// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
// Напишите программу, которая на входе принимает число
// и выдает его квадрат (число, умноженное на само себя)

int number = int.Parse(Console.ReadLine());

int quarter = number * number;

Console.WriteLine(quarter);

